CSI API ETABS v1
cDetailing.GetDetailedWall_OneWallStack_OnePier_OneDesignLeg_OneTieBar_OneTiePlineInfo Method
 Polyline(s) of the Bar shapes, in Local Design Leg Coordinates
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDetailedWall_OneWallStack_OnePier_OneDesignLeg_OneTieBar_OneTiePlineInfo(
	int WallStackIndex,
	int PierIndex,
	int DesignLegIndex,
	int TieBarIndex,
	int TiePLineIndex,
	ref double Dia,
	ref int NumberPoints,
	ref double ZoneLength,
	ref int LocationCode
)
Function GetDetailedWall_OneWallStack_OnePier_OneDesignLeg_OneTieBar_OneTiePlineInfo (
	WallStackIndex As Integer,
	PierIndex As Integer,
	DesignLegIndex As Integer,
	TieBarIndex As Integer,
	TiePLineIndex As Integer,
	ByRef Dia As Double,
	ByRef NumberPoints As Integer,
	ByRef ZoneLength As Double,
	ByRef LocationCode As Integer
) As Integer
Dim instance As cDetailing
Dim WallStackIndex As Integer
Dim PierIndex As Integer
Dim DesignLegIndex As Integer
Dim TieBarIndex As Integer
Dim TiePLineIndex As Integer
Dim Dia As Double
Dim NumberPoints As Integer
Dim ZoneLength As Double
Dim LocationCode As Integer
Dim returnValue As Integer
returnValue = instance.GetDetailedWall_OneWallStack_OnePier_OneDesignLeg_OneTieBar_OneTiePlineInfo(WallStackIndex,
	PierIndex, DesignLegIndex, TieBarIndex,
	TiePLineIndex, Dia, NumberPoints,
	ZoneLength, LocationCode)
int GetDetailedWall_OneWallStack_OnePier_OneDesignLeg_OneTieBar_OneTiePlineInfo(
	int WallStackIndex,
	int PierIndex,
	int DesignLegIndex,
	int TieBarIndex,
	int TiePLineIndex,
	double% Dia,
	int% NumberPoints,
	double% ZoneLength,
	int% LocationCode
)
abstract GetDetailedWall_OneWallStack_OnePier_OneDesignLeg_OneTieBar_OneTiePlineInfo :
        WallStackIndex : int *
        PierIndex : int *
        DesignLegIndex : int *
        TieBarIndex : int *
        TiePLineIndex : int *
        Dia : float byref *
        NumberPoints : int byref *
        ZoneLength : float byref *
        LocationCode : int byref -> int
Parameters
WallStackIndex
Type: System.Int32
 Wall Stack Index
PierIndex
Type: System.Int32
 Pier Output Index
DesignLegIndex
Type: System.Int32
 Design leg Index
TieBarIndex
Type: System.Int32
 Tie bar Index
TiePLineIndex
Type: System.Int32
 Tie Polyline Index
Dia
Type: System.Double
 Information about the size of Rebar Dia
NumberPoints
Type: System.Int32
 Number of 3D points defining the polyline
ZoneLength
Type: System.Double
 Confinement Zone Length
LocationCode
Type: System.Int32
 0 - horizontal distributed, 1 - horizontal confinement zone I, 2 - horizontal confinement zone J
Return Value
Type: Int32
Returns zero if the function is successful; otherwise it returns a nonzero value.
See Also
Reference
cDetailing Interface
ETABSv1 Namespace